## Education data on the non-OY Population to compare with OY:
This is the most current and accurate version of the data

In [1]:
%load_ext autoreload
%autoreload 2

In [47]:
import sys
import os

module_path = os.path.abspath(os.path.join(os.pardir, os.pardir))
if module_path not in sys.path:
    sys.path.append(module_path)

In [48]:
from src.data_cleaning import data_cleaning as dc

In [15]:
skc_df = dc.final_skc_df()
skc_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
32,2013000007063,19.0,1,30.0,11612,2,18,6,5,2,2,2,Ages 19-21,False
36,2013000008046,17.0,2,36.0,11613,2,13,6,5,2,2,2,Ages 16-18,False
48,2013000011255,17.0,2,13.0,11614,2,12,6,5,2,2,2,Ages 16-18,False
54,2013000012970,21.0,2,29.0,11612,3,18,6,5,2,2,2,Ages 19-21,False
57,2013000013525,18.0,2,24.0,11613,2,15,6,5,2,2,2,Ages 16-18,False

### Create a df for the non-OY Population:

In [16]:
not_oy_df = skc_df[skc_df['is_oy'] == False]
not_oy_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
32,2013000007063,19.0,1,30.0,11612,2,18,6,5,2,2,2,Ages 19-21,False
36,2013000008046,17.0,2,36.0,11613,2,13,6,5,2,2,2,Ages 16-18,False
48,2013000011255,17.0,2,13.0,11614,2,12,6,5,2,2,2,Ages 16-18,False
54,2013000012970,21.0,2,29.0,11612,3,18,6,5,2,2,2,Ages 19-21,False
57,2013000013525,18.0,2,24.0,11613,2,15,6,5,2,2,2,Ages 16-18,False

### Find the number of non-OY with no diploma:

In [19]:
# No diploma codes:
no_dip = ['bb'] + list(map(dc.pad, range(1, 16)))

no_dip_notoy_df = not_oy_df[not_oy_df['education_attained'].isin(no_dip)]
no_dip_notoy_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
36,2013000008046,17.0,2,36.0,11613,2,13,6,5,2,2,2,Ages 16-18,False
48,2013000011255,17.0,2,13.0,11614,2,12,6,5,2,2,2,Ages 16-18,False
57,2013000013525,18.0,2,24.0,11613,2,15,6,5,2,2,2,Ages 16-18,False
159,2013000032921,18.0,1,16.0,11615,2,13,6,5,2,2,2,Ages 16-18,False
162,2013000033426,21.0,1,40.0,11614,1,14,1,5,3,3,3,Ages 19-21,False

Thus, the number of non-oy without a diploma are:

In [20]:
no_dip_notoy_df['person_weight'].sum()

18822.0

Breaking this down into the 3 age groups:

In [21]:
# 16-18:
no_dip_notoy_df[no_dip_notoy_df['age_group'] == 'Ages 16-18']['person_weight'].sum()

15997.0

In [22]:
# 19-21:
no_dip_notoy_df[no_dip_notoy_df['age_group'] == 'Ages 19-21']['person_weight'].sum()

1692.0

In [23]:
# 22-24:
no_dip_notoy_df[no_dip_notoy_df['age_group'] == 'Ages 22-24']['person_weight'].sum()

1133.0

### Find the number of non-OY with a Diploma or GED:

In [26]:
# Find values for people with diploma/ged
ged_codes = ['16', '17']

ged_notoy_df = not_oy_df[not_oy_df['education_attained'].isin(ged_codes)]
ged_notoy_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
158,2013000032921,21.0,1,17.0,11615,1,16,1,5,3,3,3,Ages 19-21,False
224,2013000047506,24.0,2,5.0,11615,1,16,1,5,3,3,3,Ages 22-24,False
270,2013000056099,24.0,1,16.0,11613,1,17,1,5,2,2,2,Ages 22-24,False
348,2013000069409,17.0,1,9.0,11614,2,16,6,5,2,2,2,Ages 16-18,False
516,2013000100470,21.0,2,13.0,11613,1,16,1,5,3,3,3,Ages 19-21,False

Thus, the number of non-oy with a diploma or ged is:

In [27]:
ged_notoy_df['person_weight'].sum()

12965.0

Breaking this down into the 3 age groups:

In [28]:
# 16-18:
ged_notoy_df[ged_notoy_df['age_group'] == 'Ages 16-18']['person_weight'].sum()

2211.0

In [29]:
# 19-21:
ged_notoy_df[ged_notoy_df['age_group'] == 'Ages 19-21']['person_weight'].sum()

5007.0

In [30]:
# 22-24:
ged_notoy_df[ged_notoy_df['age_group'] == 'Ages 22-24']['person_weight'].sum()

5747.0

### Find the number of non-OY with some college but no degree:

In [35]:
# Create df for this data:
ed_codes = ['18', '19']

no_degree_df = dc.not_oy_dfs(ed_codes)
no_degree_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
32,2013000007063,19.0,1,30.0,11612,2,18,6,5,2,2,2,Ages 19-21,False
54,2013000012970,21.0,2,29.0,11612,3,18,6,5,2,2,2,Ages 19-21,False
93,2013000021239,19.0,1,91.0,11614,2,19,6,5,2,2,2,Ages 19-21,False
101,2013000022626,20.0,1,16.0,11615,2,19,3,1,1,2,2,Ages 19-21,False
160,2013000032921,18.0,1,24.0,11615,3,18,6,5,2,2,2,Ages 16-18,False

Thus, the number of non-oy with some college but no degree is:

In [39]:
no_degree_df['person_weight'].sum()

12797.0

Breaking this down into the 3 age groups:

In [53]:
dc.age_breakdown(no_degree_df)

Ages 19-21: 6805.0
Ages 16-18: 1063.0
Ages 22-24: 4929.0

### Find the number of non-OY with a degree or higher:

In [55]:
# Create df for this data:
ed_codes = list(map(str, range(20, 25)))

degree_df = dc.not_oy_dfs(ed_codes)
degree_df.head()

,id,age,sex,person_weight,puma,school_enrollment,education_attained,employment_status,avail_for_work,look_for_work,absent_from_work,layoff,age_group,is_oy
530,2013000102767,22.0,1,17.0,11615,3,21,1,5,3,3,3,Ages 22-24,False
543,2013000105303,23.0,1,17.0,11615,2,20,3,5,3,3,3,Ages 22-24,False
689,2013000135615,23.0,2,20.0,11615,2,20,6,5,2,2,2,Ages 22-24,False
740,2013000144843,24.0,2,19.0,11614,1,20,1,5,3,3,3,Ages 22-24,False
903,2013000176491,24.0,1,13.0,11613,1,21,1,5,3,3,3,Ages 22-24,False

Thus, the number of non-oy with a degree or higher is:

In [56]:
degree_df['person_weight'].sum()

6609.0

Breaking this down into the 3 age groups:

In [57]:
dc.age_breakdown(degree_df)

Ages 22-24: 4818.0
Ages 19-21: 1657.0
Ages 16-18: 134.0